Ran Plan for project: `wrestleutopia-prod` dir: `accounts/wrestleutopia-prod` workspace: `default`

<details><summary>Show Output</summary>

```diff
Wrote /home/atlantis/.atlantis/prod-ue2-multiaccounts.tfvars with secrets from SSM.

data.aws_iam_policy_document.sfn_policy: Reading...
data.aws_iam_policy_document.sfn_policy: Read complete after 0s [id=2619501375]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.dlq_policy_document will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "dlq_policy_document" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sqs:SendMessage",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "AllowLambdaServiceToSendMessage"

          + principals {
              + identifiers = [
                  + "lambda.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # aws_cloudwatch_dashboard.lambdas_dashboard will be created
+ resource "aws_cloudwatch_dashboard" "lambdas_dashboard" {
      + dashboard_arn  = (known after apply)
      + dashboard_body = (known after apply)
      + dashboard_name = "LambdaDashboard"
      + id             = (known after apply)
    }

  # aws_cloudwatch_dashboard.step_functions_dashboard will be created
+ resource "aws_cloudwatch_dashboard" "step_functions_dashboard" {
      + dashboard_arn  = (known after apply)
      + dashboard_body = (known after apply)
      + dashboard_name = "StepFunctionsDashboard"
      + id             = (known after apply)
    }

  # aws_cloudwatch_event_rule.workflow_schedule will be created
+ resource "aws_cloudwatch_event_rule" "workflow_schedule" {
      + arn                
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.